<div style="padding: 15px; border: 5px solid transparent; border-color: transparent; margin-bottom: 20px; border-radius: 4px; color: #3c763d; background-color: #dff0d8; border-color: #d6e9c6; font-weight: bold;">
    <br><br>
    <div style="font-weight: bold; font-size: 40px">파이썬으로 끝내는 인공지능 A to Z</div>
    <div style="font-weight: bold; font-size: 20px">[09] 형태를 갖춘 데이터와 전처리</div>
    <hr style="width:80%;text-align:left;margin-left:0;border:0.5px solid green">
    <br>
    &#x2022; 정형 데이터의 형태와 특징에 대해 이해할 수 있다.<br>
    &#x2022; 정형 데이터의 구조를 살펴보고 활용하기 쉽게 전처리할 수 있다.<br>
</div>

<div style="padding: 15px; border: 5px solid transparent; border-color: transparent; margin-bottom: 20px; border-radius: 4px; color: #3c763d; border-color: #d6e9c6; font-weight: bold;">
<h2 style='font-weight: bold'>1. 정형 데이터의 특징</h2>
</div>

**정형 데이터**는 미리 정해 놓은 형식과 구조에 따라 저장되도록 구성된 데이터에요.  
정형 데이터가 가지는 특징이 무엇인지, 어떻게 활용할 수 있을지 알아보아요.

<table>
<tr>
    <th><img src="https://tmn-bucket-materials-all.s3.ap-northeast-2.amazonaws.com/image/ai/AI-02-01.png" width="500"></th>
    </tr>
<tr>
    <th>정형 데이터와 비정형 데이터</th>
</tr>
</table>

<div style="padding: 15px; border: 5px solid transparent; border-color: transparent; margin-bottom: 20px; border-radius: 4px; color: #31708f; border-color: #bce8f1;">
    <div style="font-weight: bold; font-size: 20px">📌 TIP</div>
표 형태로 나타낸 것이 정형 데이터로, 영상이나 언어 등의 비정형 데이터와 다른 구조에요.  
</div>

정형 데이터는 표와 같이 명확한 구조를 가지고 있어서 여러 장점을 가지고 있어요.
* 행과 열로 모든 데이터를 표현할 수 있어, **컴퓨터가 접근**하기 쉬워요.
* 각 열마다 **공통된 속성**(**숫자, 문자열, 날짜 등**)을 가지기 때문에 필요한 특징을 분석하기 쉬워요.
* 데이터가 체계적으로 저장되어서 **저장 공간**이 많이 필요하지 않아요. 
* 데이터를 수집하거나 수정하는 등 **관리하기 편리**해요.

<table>
<tr>
    <th><img src="https://tmn-bucket-materials-all.s3.ap-northeast-2.amazonaws.com/image/ai/AI-02-02.png" width="500"></th>
    </tr>
<tr>
    <th>정형 데이터의 특징</th>
</tr>
</table>

### **정형 데이터 수집**
인공지능 학습에 사용하는 정형 데이터를 제공하는 여러 사이트가 있어요.  
여기서는 대표적으로 두 가지 예시를 소개할게요.   
* 공공 데이터 포털(https://www.data.go.kr/): 다양한 분야의 데이터가 있지만, 때때로 값이 고르지 못해 전처리 과정이 필요하기도 해요.
* 캐글(https://www.kaggle.com/): 주어진 데이터로 과제를 해결하기 위한 대회 플랫폼이에요. 대회를 위한 데이터를 제공하기 때문에 어느 정도 전처리가 되어 있어요.

### **정형 데이터의 형태**

정형 데이터의 형태는 CSV(Comma Separated Values), 관계형 데이터베이스, 스프레드시트 등 여러 가지가 있어요.  
대표적인 예시인 CSV는, 아래와 같이 각 데이터 값을 쉼표로 구분하는 형태입니다.

<table>
<tr>
    <th><img src="https://tmn-bucket-materials-all.s3.ap-northeast-2.amazonaws.com/image/ai/AI-02-03.gif" width="500"></th>
    </tr>
<tr>
    <th>CSV 파일의 형태</th>
</tr>
</table>

<div style="padding: 15px; border: 5px solid transparent; border-color: transparent; margin-bottom: 20px; border-radius: 4px; color: #3c763d; border-color: #d6e9c6; font-weight: bold;">
<h2 style='font-weight: bold'>2. 데이터 전처리 실습하기</h2>
</div>

인공지능을 좋은 방법으로 학습하는 것만큼 올바른 데이터를 사용하는 것도 중요해요.  
원하는 성능으로 인공지능을 학습시키려면, 수집한 데이터를 전처리하여 데이터의 품질을 높여야 해요.  
pandas를 사용하여, 정형 데이터에 대해 전처리하는 과정을 배워봐요.

### **pandas 라이브러리**

pandas는 데이터를 분석하기 위한 python 라이브러리에요.  
pandas를 활용하여, python으로 엑셀을 다루듯이 데이터 구조를 만들고 다룰 수 있어요.  

* python만으로 데이터를 분석할 때보다 속도가 빨라요.
* 누락된 데이터를 처리하기 용이해요.
* 데이터 구조에 수정, 삽입 등 변형이 자유로워요.

### **pandas 라이브러리를 이용한 데이터 전처리**

pandas를 사용하여 실제로 정형 데이터를 같이 확인해보고 누락된 데이터를 전처리해요.  
1912년 타이타닉호 침몰 사고의 실제 데이터를 활용하여, 어떤 정보가 있는지 살펴봐요.  
우선 csv파일 형태로 저장된 데이터 프레임을 불러오고 정보를 파악해보아요.

In [1]:
# titanic 데이터 프레임 불러오기
import pandas as pd
import io
import requests
url = "https://tmn-bucket-materials-all.s3.ap-northeast-2.amazonaws.com/data/2-4.+titanic.csv"
s = requests.get(url).content

titanic = pd.read_csv(io.StringIO(s.decode('utf-8')))

In [2]:
# titanic 데이터 프레임의 정보 확인
print('titanic 데이터 프레임의 크기:', titanic.shape)
print(titanic.info( ))

titanic 데이터 프레임의 크기: (891, 12)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

In [3]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# titanic 데이터 프레임의 속성별 고유한 데이터의 개수
titanic.nunique( )

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [5]:
# titanic['Survived'].unique( )
# titanic['Sex'].unique( )
# titanic['Pclass'].unique( )
titanic['Embarked'].unique( )

array(['S', 'C', 'Q', nan], dtype=object)

타이타닉 데이터 프레임에는 12가지의 데이터가 있다는 것을 확인했어요.  
그러면 이제 데이터의 결측치를 확인하고, 각 데이터의 특성에 맞게 이를 전처리하여 해결해보아요.

In [6]:
# 결측치 확인
titanic.isnull( ).sum( )

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
titanic[["Age", "Cabin", "Embarked"]].head(10)

    Age Cabin Embarked
0  22.0   NaN        S
1  38.0   C85        C
2  26.0   NaN        S
3  35.0  C123        S
4  35.0   NaN        S
5   NaN   NaN        Q
6  54.0   E46        S
7   2.0   NaN        S
8  27.0   NaN        S
9  14.0   NaN        C

In [13]:
# Age 데이터의 결측치 전처리
titanic['Age'] = titanic['Age'].fillna(titanic['Age'].mean( ))
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,NaN,Q

In [9]:
# Embarked 데이터의 결측치 전처리
titanic.groupby('Embarked')['PassengerId'].count( )

Embarked
C    168
Q     77
S    644
Name: PassengerId, dtype: int64

In [10]:
titanic['Embarked'] = titanic['Embarked'].fillna('S')

In [11]:
# 결측치 재확인
titanic.isnull( ).sum( )

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

<div style="padding: 15px; border: 5px solid transparent; border-color: transparent; margin-bottom: 20px; border-radius: 4px; color: #8a6d3b;  border-color: #faebcc;">
    <div style="font-weight: bold; font-size: 20px">💯 연습문제를 풀어봅시다</div>
    
1. <a class="jcecodle-mk jcecodle-mk__problem-chip" data-problem-id="5m7SDG-ud94" href='#jce-judge/open/5m7SDG-ud94' target='_self'><span>데이터 전처리 연습</span></a>
2. <a class="jcecodle-mk jcecodle-mk__problem-chip" data-problem-id="L42tTfYUbxk" href='#jce-judge/open/L42tTfYUbxk' target='_self'><span>가계부 결측값 변경</span></a>
3. <a class="jcecodle-mk jcecodle-mk__problem-chip" data-problem-id="1a5lam-7dW8" href='#jce-judge/open/1a5lam-7dW8' target='_self'><span>판다스 - 결측값 처리 - 일괄 변경</span></a>
4. <a class="jcecodle-mk jcecodle-mk__problem-chip" data-problem-id="Rx-lpctLFg4" href='#jce-judge/open/Rx-lpctLFg4' target='_self'><span>판다스 - 결측값 처리 - 열에 따라 변경 (3)</span></a>